load-tests/k6/reports/20260413-193500-local/planning-read-stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\load-tests\k6\scenarios\planning-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.1s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.1s/1m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.1s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.1s/1m0s

running (0m22.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 1 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m01.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m02.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m03.0s), 09/10 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m04.0s), 08/10 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m05.0s), 05/10 VUs, 16 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m06.0s), 03/10 VUs, 18 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m07.0s), 01/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

     ✗ login status is 2xx
      ↳  95% — ✓ 20 / ✗ 1
     ✓ wbs tree status is 2xx
     ✓ wbs activities status is 2xx
     ✓ project schedule status is 2xx
     ✓ planning stats status is 2xx
     ✓ planning matrix status is 2xx
     ✓ planning unlinked status is 2xx
     ✓ planning boq mapper status is 2xx
     ✓ planning gap analysis status is 2xx
     ✓ planning execution ready status is 2xx
     ✓ planning distribution matrix status is 2xx
     ✓ planning relationships status is 2xx
     ✓ planning versions status is 2xx
     ✓ workdoc vendors status is 2xx
     ✓ workdoc project work orders status is 2xx
     ✗ workdoc linkage data status is 2xx
      ↳  0% — ✓ 0 / ✗ 20
     ✓ workdoc boq tree status is 2xx
     ✓ workdoc available boq qty status is 2xx

     checks.........................: 94.18% ✓ 340      ✗ 21  
     data_received..................: 100 MB 1.5 MB/s
     data_sent......................: 3.2 MB 47 kB/s
     http_req_blocked...............: avg=1.9ms    min=0s     med=0s       max=69.36ms p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=107.25µs min=0s     med=0s       max=4.51ms  p(90)=0s      p(95)=0s      
   ✗ http_req_duration..............: avg=1.4s     min=9.61ms med=609.04ms max=11.7s   p(90)=4.15s   p(95)=5.31s   
       { expected_response:true }...: avg=1.49s    min=11.5ms med=734.84ms max=11.7s   p(90)=4.23s   p(95)=5.33s   
     http_req_failed................: 5.81%  ✓ 21       ✗ 340 
     http_req_receiving.............: avg=89.21ms  min=0s     med=708.7µs  max=2.78s   p(90)=71.62ms p(95)=407.17ms
     http_req_sending...............: avg=562.99µs min=0s     med=522.8µs  max=28.5ms  p(90)=924.4µs p(95)=1.14ms  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=1.31s    min=8.52ms med=607.46ms max=11.7s   p(90)=3.68s   p(95)=4.95s   
     http_reqs......................: 361    5.347152/s
     iteration_duration.............: avg=30.98s   min=1.01s  med=33.02s   max=37.18s  p(90)=35.13s  p(95)=36.1s   
     iterations.....................: 21     0.311053/s
     vus............................: 1      min=1      max=10
     vus_max........................: 10     min=10     max=10


running (1m07.5s), 00/10 VUs, 21 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s